"""
    опишіть 1 будь-який клас, за умови що буде існувати тільки один інстанс цього класу.
    опишіть частину функціоналу замовлення в ресторані. OrderPart класс має метод, що повертає певне блюдо.
    Можуть бути різні блюда, наприклад Risotto, Pasta, Pizza, які наслідуються від одного батьківського абстрактного класу Dish(Factory).

*необов'язкова задача. Доповніть 2 задачу, додавши  розділи, окрім блюда, наприклад напої, або розділивши блюда на
холодні та гарячі. На Ваш розсуд, розширте існуючий клас OrderPart, або створіть додатковий для обробки нового розділу.
Створіть клас Order, який зберігатиме час замовлення і всі замовлені блюда/напої
"""