"""
Завдання 1:

    Напишіть програму, в яку спочатку запишіть в 1 змінну ваше ім'я, в 2 ваше прізвище, а потім виводить на екран повідомлення з вашими особистими даними.
    Тут використайте конкатенацію, тобто об'єднайте стрічки.
    Виведіть результат в нижньому, верхнього регістрах з капіталізацією перших букв кожного слова.
    Змініть значення своєї змінної, яку ви створили на кроці 1 , додавши до свого імені декілька пробілів на початку та вкінці.
    Прослідкуйте щоб \t \n зустрічались хоча б один раз. Виведіть нове значення. Видаліть пропуски і збережіть новий результат.


Завдання 2:

    Створіть змінну що містить поточний курс долара
    Створіть нову змінну що конвертує 1000 гривень в долар
    Заокругліть отримане значення до двох знаків після коми
    Виведіть результат за допомогою форматування (“Поточний курс складає: значення”)
"""

"""Task 1"""

name = "Serhii"
surname = "Honta"
fullName = name + " " + surname
print(fullName)
print(fullName.upper())
print(fullName.lower())
print(fullName.capitalize())
print(fullName.title())

newFullName = "\t \n \t " + fullName + "\t \n"
print(newFullName.strip())

"""Task 2"""

currentCurs = float(38.7)
exchange = round((1000 / currentCurs),2)
print(exchange)

