"""
Опишіть об'єкт Train. Класс має поля і метод додавання вагонів (додавати треба об'єкти інстанси класа вагон).
Опишіть  класс TrainCar (вагон). Вагон поля і список пасажирів і дозволяє додавати пасажирів. В вагоні може бути,
наприклад,10 пасажирів. При виконанні функції len на вагоні виведіть кількість пасажирів.
При виконанні функції len на потязі виведіть кількість вагонів без локомотива. У кожного вагона має бути номер.

за допомогою __str__реалізуйте вивід в консоль:

При перегляді кожного окремого пасажира в вагоні виводьте данні за наступним паттерном(назви полів для прикладу):

"name": "John Dow",

"destination": "Name of station",

"place": 9

Необов'язкова задача з зірочкою. перепишіть ваш потяг, щоб він рухався по станціям, наприклад, Лондон-Гогвортс,
або інша комбінація. Нехай на певних зупинках люди заходять, на певних виходять. Виведіть в консоль людей, які зайшли в
потяг на кожній станції, які вийшли.
"""