"""
    Реалізуйте біблиотеку з будь-яким функціоналом. Наприклад, створіть функції для арифметичних операцій і побудуйте каскад
    імпортів з декількох packagів. Має бути можливіcть імпортувати деякі функції з пакета, але не всі.
    Створіть обробку одного будь-якого exception, який не використався як приклад на занятті. Виведіть результат в консоль
    Реалізуйте функцію, яка додає або віднімає від заданої дати певну кількість днів. Приймає на вхід будь-яку дату
    та час (datetime), а також значення днів(int), і знак(True або False, які репрезентують + і -).
    Повертає datetime. В цій задачі скористайтесь datetime.timedelta
    Реалізуйте функцію, яка вираховує ваш точний вік(не обов'язково вказувати свої данні), вираховуючі різницю між
    наданим значеням і значенням datetime.now(). Приймає дату та час(datetime), повертає два значення: datetime і datetime.timestamp.
    В цій задачі скористайтесь для конвертації datetime.timestamp. Виведіть результат в консоль
"""