"""
Для всіх трьох задач скористайтесь написанням функцій. В межах розумного робіть функції невеликими за розміром і перевикористовуйте код.


1.Дано два списки чисел. Знайдіть всі числа, що зустрічаються як в першому, так і другому списках, і надрукуйте їх у порядку зростання.
2.Створіть словник із даними про студентів: ключі - імена студентів, значення - бали для кожного.
Програма повинна визначити середній бал і вивести імена студентів, чий бал вище середнього.
3.Створіть списки із значеннями для name, surname, location, наприклад name = ['Alex', 'John', 'Simba'].
напишіть програму, яка створює словники з даними випадкових людей на основі ваших списків, роздрукуйте результат.
для випадковості значень скористайтесь модулем random. приклад згенерованого словника:
{'name':'Liza', 'surname':'Djoconda', 'location':'Florence'}
"""